{"modelTopology":{"class_name":"Model","config":{"name":"model9","layers":[{"name":"dr_in","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5,2],"dtype":"float32","sparse":false,"name":"dr_in"},"inbound_nodes":[]},{"name":"dr_2d","class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"dr_2d","trainable":true},"inbound_nodes":[[["dr_in",0,0,{}]]]},{"name":"dr_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"dr_bn","trainable":true},"inbound_nodes":[[["dr_2d",0,0,{}]]]},{"name":"dr_rl","class_name":"ReLU","config":{"max_value":null,"name":"dr_rl","trainable":true},"inbound_nodes":[[["dr_bn",0,0,{}]]]},{"name":"dr_fl","class_name":"Flatten","config":{"name":"dr_fl","trainable":true},"inbound_nodes":[[["dr_rl",0,0,{}]]]},{"name":"dr_de","class_name":"Dense","config":{"units":1,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dr_de","trainable":true},"inbound_nodes":[[["dr_fl",0,0,{}]]]}],"input_layers":[["dr_in",0,0]],"output_layers":[["dr_de",0,0]]},"keras_version":"tfjs-layers 4.19.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dr_2d/kernel","shape":[1,1,2,4],"dtype":"float32"},{"name":"dr_2d/bias","shape":[4],"dtype":"float32"},{"name":"dr_bn/gamma","shape":[4],"dtype":"float32"},{"name":"dr_bn/beta","shape":[4],"dtype":"float32"},{"name":"dr_de/kernel","shape":[100,1],"dtype":"float32"},{"name":"dr_de/bias","shape":[1],"dtype":"float32"},{"name":"dr_bn/moving_mean","shape":[4],"dtype":"float32"},{"name":"dr_bn/moving_variance","shape":[4],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.19.0","convertedBy":null}