{"modelTopology":{"class_name":"Model","config":{"name":"Prediction Policy Model","layers":[{"name":"hidden_state_input","class_name":"InputLayer","config":{"batch_input_shape":[null,32],"dtype":"float32","sparse":false,"name":"hidden_state_input"},"inbound_nodes":[]},{"name":"prediction_policy_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_policy_hidden","trainable":true},"inbound_nodes":[[["hidden_state_input",0,0,{}]]]},{"name":"prediction_policy_output","class_name":"Dense","config":{"units":9,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_policy_output","trainable":true},"inbound_nodes":[[["prediction_policy_hidden",0,0,{}]]]}],"input_layers":[["hidden_state_input",0,0]],"output_layers":[["prediction_policy_output",0,0]]},"keras_version":"tfjs-layers 3.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"prediction_policy_hidden/kernel","shape":[32,64],"dtype":"float32"},{"name":"prediction_policy_hidden/bias","shape":[64],"dtype":"float32"},{"name":"prediction_policy_output/kernel","shape":[64,9],"dtype":"float32"},{"name":"prediction_policy_output/bias","shape":[9],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.21.0","convertedBy":null}