{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_19","layers":[{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_reward_hidden","trainable":true,"batch_input_shape":[null,38],"dtype":"float32"}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_reward_output","trainable":true}}]},"keras_version":"tfjs-layers 4.3.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dynamics_reward_hidden/kernel","shape":[38,32],"dtype":"float32"},{"name":"dynamics_reward_output/kernel","shape":[32,1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.3.0","convertedBy":null}