{"modelTopology":{"class_name":"Model","config":{"name":"Initial Inference Model","layers":[{"name":"observation_input","class_name":"InputLayer","config":{"batch_input_shape":[null,25],"dtype":"float32","sparse":false,"name":"observation_input"},"inbound_nodes":[]},{"name":"representation_state_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"representation_state_hidden","trainable":true},"inbound_nodes":[[["observation_input",0,0,{}]]]},{"name":"representation_state_output","class_name":"Dense","config":{"units":32,"activation":"softsign","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"representation_state_output","trainable":true},"inbound_nodes":[[["representation_state_hidden",0,0,{}]]]},{"name":"prediction_policy_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_policy_hidden","trainable":true},"inbound_nodes":[[["representation_state_output",0,0,{}]]]},{"name":"prediction_value_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_value_hidden","trainable":true},"inbound_nodes":[[["representation_state_output",0,0,{}]]]},{"name":"prediction_policy_output","class_name":"Dense","config":{"units":25,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_policy_output","trainable":true},"inbound_nodes":[[["prediction_policy_hidden",0,0,{}]]]},{"name":"prediction_value_output","class_name":"Dense","config":{"units":21,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"Zeros","config":{}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_value_output","trainable":true},"inbound_nodes":[[["prediction_value_hidden",0,0,{}]]]}],"input_layers":[["observation_input",0,0]],"output_layers":[["prediction_policy_output",0,0],["prediction_value_output",0,0],["representation_state_output",0,0]]},"keras_version":"tfjs-layers 3.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"representation_state_hidden/kernel","shape":[25,64],"dtype":"float32"},{"name":"representation_state_output/kernel","shape":[64,32],"dtype":"float32"},{"name":"prediction_policy_hidden/kernel","shape":[32,64],"dtype":"float32"},{"name":"prediction_value_hidden/kernel","shape":[32,64],"dtype":"float32"},{"name":"prediction_policy_output/kernel","shape":[64,25],"dtype":"float32"},{"name":"prediction_value_output/kernel","shape":[64,21],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.21.0","convertedBy":null}