{"modelTopology":{"class_name":"Model","config":{"name":"Representation Model","layers":[{"name":"observation_input","class_name":"InputLayer","config":{"batch_input_shape":[null,9],"dtype":"float32","sparse":false,"name":"observation_input"},"inbound_nodes":[]},{"name":"representation_state_output","class_name":"Dense","config":{"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"representation_state_output","trainable":true},"inbound_nodes":[[["observation_input",0,0,{}]]]}],"input_layers":[["observation_input",0,0]],"output_layers":[["representation_state_output",0,0]]},"keras_version":"tfjs-layers 3.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"representation_state_output/kernel","shape":[9,32],"dtype":"float32"},{"name":"representation_state_output/bias","shape":[32],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.21.0","convertedBy":null}