{"modelTopology":{"class_name":"Model","config":{"name":"Dynamics Reward Model","layers":[{"name":"action_plane_input","class_name":"InputLayer","config":{"batch_input_shape":[null,41],"dtype":"float32","sparse":false,"name":"action_plane_input"},"inbound_nodes":[]},{"name":"dynamics_reward_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_reward_hidden","trainable":true},"inbound_nodes":[[["action_plane_input",0,0,{}]]]},{"name":"dynamics_reward_output","class_name":"Dense","config":{"units":21,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"Zeros","config":{}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.0001,"l2":0.0001}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_reward_output","trainable":true},"inbound_nodes":[[["dynamics_reward_hidden",0,0,{}]]]}],"input_layers":[["action_plane_input",0,0]],"output_layers":[["dynamics_reward_output",0,0]]},"keras_version":"tfjs-layers 3.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dynamics_reward_hidden/kernel","shape":[41,64],"dtype":"float32"},{"name":"dynamics_reward_hidden/bias","shape":[64],"dtype":"float32"},{"name":"dynamics_reward_output/kernel","shape":[64,21],"dtype":"float32"},{"name":"dynamics_reward_output/bias","shape":[21],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.21.0","convertedBy":null}