{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"hs_in","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5,1],"dtype":"float32","sparse":false,"name":"hs_in"},"inbound_nodes":[]},{"name":"hs_rb0_2d","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb0_2d","trainable":true},"inbound_nodes":[[["hs_in",0,0,{}]]]},{"name":"hs_rb0_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb0_bn","trainable":true},"inbound_nodes":[[["hs_rb0_2d",0,0,{}]]]},{"name":"hs_rl0","class_name":"ReLU","config":{"max_value":null,"name":"hs_rl0","trainable":true},"inbound_nodes":[[["hs_rb0_bn",0,0,{}]]]},{"name":"hs_rb1_2d","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb1_2d","trainable":true},"inbound_nodes":[[["hs_rl0",0,0,{}]]]},{"name":"hs_rb1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb1_bn","trainable":true},"inbound_nodes":[[["hs_rb1_2d",0,0,{}]]]},{"name":"hs_rb1_ad","class_name":"Add","config":{"name":"hs_rb1_ad","trainable":true},"inbound_nodes":[[["hs_rl0",0,0,{}],["hs_rb1_bn",0,0,{}]]]},{"name":"hs_rb1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb1_rl","trainable":true},"inbound_nodes":[[["hs_rb1_ad",0,0,{}]]]},{"name":"hs_rb2_2d","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb2_2d","trainable":true},"inbound_nodes":[[["hs_rb1_rl",0,0,{}]]]},{"name":"hs_rb2_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb2_bn","trainable":true},"inbound_nodes":[[["hs_rb2_2d",0,0,{}]]]},{"name":"hs_rb2_ad","class_name":"Add","config":{"name":"hs_rb2_ad","trainable":true},"inbound_nodes":[[["hs_rb1_rl",0,0,{}],["hs_rb2_bn",0,0,{}]]]},{"name":"hs_rb2_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb2_rl","trainable":true},"inbound_nodes":[[["hs_rb2_ad",0,0,{}]]]},{"name":"hs_rb3_2d","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb3_2d","trainable":true},"inbound_nodes":[[["hs_rb2_rl",0,0,{}]]]},{"name":"hs_rb3_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb3_bn","trainable":true},"inbound_nodes":[[["hs_rb3_2d",0,0,{}]]]},{"name":"hs_rb3_ad","class_name":"Add","config":{"name":"hs_rb3_ad","trainable":true},"inbound_nodes":[[["hs_rb2_rl",0,0,{}],["hs_rb3_bn",0,0,{}]]]},{"name":"hs_rb3_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb3_rl","trainable":true},"inbound_nodes":[[["hs_rb3_ad",0,0,{}]]]},{"name":"hs_rb4_2d","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb4_2d","trainable":true},"inbound_nodes":[[["hs_rb3_rl",0,0,{}]]]},{"name":"hs_rb4_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb4_bn","trainable":true},"inbound_nodes":[[["hs_rb4_2d",0,0,{}]]]},{"name":"hs_rb4_ad","class_name":"Add","config":{"name":"hs_rb4_ad","trainable":true},"inbound_nodes":[[["hs_rb3_rl",0,0,{}],["hs_rb4_bn",0,0,{}]]]},{"name":"hs_rb4_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb4_rl","trainable":true},"inbound_nodes":[[["hs_rb4_ad",0,0,{}]]]},{"name":"hs_rb5_2d","class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb5_2d","trainable":true},"inbound_nodes":[[["hs_rb4_rl",0,0,{}]]]},{"name":"hs_rl5","class_name":"ReLU","config":{"max_value":null,"name":"hs_rl5","trainable":true},"inbound_nodes":[[["hs_rb5_2d",0,0,{}]]]}],"input_layers":[["hs_in",0,0]],"output_layers":[["hs_rl5",0,0]]},"keras_version":"tfjs-layers 4.19.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"hs_rb0_2d/kernel","shape":[3,3,1,16],"dtype":"float32"},{"name":"hs_rb0_2d/bias","shape":[16],"dtype":"float32"},{"name":"hs_rb0_bn/gamma","shape":[16],"dtype":"float32"},{"name":"hs_rb0_bn/beta","shape":[16],"dtype":"float32"},{"name":"hs_rb1_2d/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"hs_rb1_2d/bias","shape":[16],"dtype":"float32"},{"name":"hs_rb1_bn/gamma","shape":[16],"dtype":"float32"},{"name":"hs_rb1_bn/beta","shape":[16],"dtype":"float32"},{"name":"hs_rb2_2d/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"hs_rb2_2d/bias","shape":[16],"dtype":"float32"},{"name":"hs_rb2_bn/gamma","shape":[16],"dtype":"float32"},{"name":"hs_rb2_bn/beta","shape":[16],"dtype":"float32"},{"name":"hs_rb3_2d/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"hs_rb3_2d/bias","shape":[16],"dtype":"float32"},{"name":"hs_rb3_bn/gamma","shape":[16],"dtype":"float32"},{"name":"hs_rb3_bn/beta","shape":[16],"dtype":"float32"},{"name":"hs_rb4_2d/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"hs_rb4_2d/bias","shape":[16],"dtype":"float32"},{"name":"hs_rb4_bn/gamma","shape":[16],"dtype":"float32"},{"name":"hs_rb4_bn/beta","shape":[16],"dtype":"float32"},{"name":"hs_rb5_2d/kernel","shape":[3,3,16,1],"dtype":"float32"},{"name":"hs_rb5_2d/bias","shape":[1],"dtype":"float32"},{"name":"hs_rb0_bn/moving_mean","shape":[16],"dtype":"float32"},{"name":"hs_rb0_bn/moving_variance","shape":[16],"dtype":"float32"},{"name":"hs_rb1_bn/moving_mean","shape":[16],"dtype":"float32"},{"name":"hs_rb1_bn/moving_variance","shape":[16],"dtype":"float32"},{"name":"hs_rb2_bn/moving_mean","shape":[16],"dtype":"float32"},{"name":"hs_rb2_bn/moving_variance","shape":[16],"dtype":"float32"},{"name":"hs_rb3_bn/moving_mean","shape":[16],"dtype":"float32"},{"name":"hs_rb3_bn/moving_variance","shape":[16],"dtype":"float32"},{"name":"hs_rb4_bn/moving_mean","shape":[16],"dtype":"float32"},{"name":"hs_rb4_bn/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.19.0","convertedBy":null}