{"modelTopology":{"class_name":"Model","config":{"name":"model8","layers":[{"name":"fp_in","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5,1],"dtype":"float32","sparse":false,"name":"fp_in"},"inbound_nodes":[]},{"name":"fp_f1_cv","class_name":"Conv2D","config":{"filters":2,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"fp_f1_cv","trainable":true},"inbound_nodes":[[["fp_in",0,0,{}]]]},{"name":"fp_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"fp_f1_bn","trainable":true},"inbound_nodes":[[["fp_f1_cv",0,0,{}]]]},{"name":"fp_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"fp_f1_rl","trainable":true},"inbound_nodes":[[["fp_f1_bn",0,0,{}]]]},{"name":"fp_f2_cv","class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"fp_f2_cv","trainable":true},"inbound_nodes":[[["fp_f1_rl",0,0,{}]]]},{"name":"fp_fl","class_name":"Flatten","config":{"name":"fp_fl","trainable":true},"inbound_nodes":[[["fp_f2_cv",0,0,{}]]]},{"name":"fp_de","class_name":"Dense","config":{"units":15,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"fp_de","trainable":true},"inbound_nodes":[[["fp_fl",0,0,{}]]]}],"input_layers":[["fp_in",0,0]],"output_layers":[["fp_de",0,0]]},"keras_version":"tfjs-layers 4.19.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"fp_f1_cv/kernel","shape":[1,1,1,2],"dtype":"float32"},{"name":"fp_f1_cv/bias","shape":[2],"dtype":"float32"},{"name":"fp_f1_bn/gamma","shape":[2],"dtype":"float32"},{"name":"fp_f1_bn/beta","shape":[2],"dtype":"float32"},{"name":"fp_f2_cv/kernel","shape":[1,1,2,1],"dtype":"float32"},{"name":"fp_f2_cv/bias","shape":[1],"dtype":"float32"},{"name":"fp_de/kernel","shape":[25,15],"dtype":"float32"},{"name":"fp_de/bias","shape":[15],"dtype":"float32"},{"name":"fp_f1_bn/moving_mean","shape":[2],"dtype":"float32"},{"name":"fp_f1_bn/moving_variance","shape":[2],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.19.0","convertedBy":null}