{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"hs_in","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5,1],"dtype":"float32","sparse":false,"name":"hs_in"},"inbound_nodes":[]},{"name":"hs_f1_cv","class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_f1_cv","trainable":true},"inbound_nodes":[[["hs_in",0,0,{}]]]},{"name":"hs_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_f1_bn","trainable":true},"inbound_nodes":[[["hs_f1_cv",0,0,{}]]]},{"name":"hs_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_f1_rl","trainable":true},"inbound_nodes":[[["hs_f1_bn",0,0,{}]]]},{"name":"hs_rb1_f1_cv","class_name":"Conv2D","config":{"filters":2,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb1_f1_cv","trainable":true},"inbound_nodes":[[["hs_f1_rl",0,0,{}]]]},{"name":"hs_rb1_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb1_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb1_f1_cv",0,0,{}]]]},{"name":"hs_rb1_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb1_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb1_f1_bn",0,0,{}]]]},{"name":"hs_rb1_ad","class_name":"Add","config":{"name":"hs_rb1_ad","trainable":true},"inbound_nodes":[[["hs_rb1_f1_cv",0,0,{}],["hs_rb1_f1_rl",0,0,{}]]]},{"name":"hs_rb2_f1_cv","class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb2_f1_cv","trainable":true},"inbound_nodes":[[["hs_rb1_ad",0,0,{}]]]},{"name":"hs_rb2_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb2_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb2_f1_cv",0,0,{}]]]},{"name":"hs_rb2_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb2_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb2_f1_bn",0,0,{}]]]},{"name":"hs_rb2_ad","class_name":"Add","config":{"name":"hs_rb2_ad","trainable":true},"inbound_nodes":[[["hs_rb2_f1_cv",0,0,{}],["hs_rb2_f1_rl",0,0,{}]]]},{"name":"hs_rb3_f1_cv","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb3_f1_cv","trainable":true},"inbound_nodes":[[["hs_rb2_ad",0,0,{}]]]},{"name":"hs_rb3_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb3_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb3_f1_cv",0,0,{}]]]},{"name":"hs_rb3_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb3_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb3_f1_bn",0,0,{}]]]},{"name":"hs_rb3_ad","class_name":"Add","config":{"name":"hs_rb3_ad","trainable":true},"inbound_nodes":[[["hs_rb3_f1_cv",0,0,{}],["hs_rb3_f1_rl",0,0,{}]]]},{"name":"hs_rb4_f1_cv","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb4_f1_cv","trainable":true},"inbound_nodes":[[["hs_rb3_ad",0,0,{}]]]},{"name":"hs_rb4_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb4_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb4_f1_cv",0,0,{}]]]},{"name":"hs_rb4_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb4_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb4_f1_bn",0,0,{}]]]},{"name":"hs_rb4_ad","class_name":"Add","config":{"name":"hs_rb4_ad","trainable":true},"inbound_nodes":[[["hs_rb4_f1_cv",0,0,{}],["hs_rb4_f1_rl",0,0,{}]]]},{"name":"hs_rb5_f1_cv","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb5_f1_cv","trainable":true},"inbound_nodes":[[["hs_rb4_ad",0,0,{}]]]},{"name":"hs_rb5_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb5_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb5_f1_cv",0,0,{}]]]},{"name":"hs_rb5_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb5_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb5_f1_bn",0,0,{}]]]},{"name":"hs_rb5_ad","class_name":"Add","config":{"name":"hs_rb5_ad","trainable":true},"inbound_nodes":[[["hs_rb5_f1_cv",0,0,{}],["hs_rb5_f1_rl",0,0,{}]]]},{"name":"hs_rb6_f1_cv","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb6_f1_cv","trainable":true},"inbound_nodes":[[["hs_rb5_ad",0,0,{}]]]},{"name":"hs_rb6_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb6_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb6_f1_cv",0,0,{}]]]},{"name":"hs_rb6_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb6_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb6_f1_bn",0,0,{}]]]},{"name":"hs_rb6_ad","class_name":"Add","config":{"name":"hs_rb6_ad","trainable":true},"inbound_nodes":[[["hs_rb6_f1_cv",0,0,{}],["hs_rb6_f1_rl",0,0,{}]]]},{"name":"hs_rb7_f1_cv","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb7_f1_cv","trainable":true},"inbound_nodes":[[["hs_rb6_ad",0,0,{}]]]},{"name":"hs_rb7_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb7_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb7_f1_cv",0,0,{}]]]},{"name":"hs_rb7_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb7_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb7_f1_bn",0,0,{}]]]},{"name":"hs_rb7_ad","class_name":"Add","config":{"name":"hs_rb7_ad","trainable":true},"inbound_nodes":[[["hs_rb7_f1_cv",0,0,{}],["hs_rb7_f1_rl",0,0,{}]]]},{"name":"hs_rb8_f1_cv","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"hs_rb8_f1_cv","trainable":true},"inbound_nodes":[[["hs_rb7_ad",0,0,{}]]]},{"name":"hs_rb8_f1_bn","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"hs_rb8_f1_bn","trainable":true},"inbound_nodes":[[["hs_rb8_f1_cv",0,0,{}]]]},{"name":"hs_rb8_f1_rl","class_name":"ReLU","config":{"max_value":null,"name":"hs_rb8_f1_rl","trainable":true},"inbound_nodes":[[["hs_rb8_f1_bn",0,0,{}]]]},{"name":"hs_rb8_ad","class_name":"Add","config":{"name":"hs_rb8_ad","trainable":true},"inbound_nodes":[[["hs_rb8_f1_cv",0,0,{}],["hs_rb8_f1_rl",0,0,{}]]]},{"name":"hs_fl","class_name":"Flatten","config":{"name":"hs_fl","trainable":true},"inbound_nodes":[[["hs_rb8_ad",0,0,{}]]]},{"name":"hs_de","class_name":"Dense","config":{"units":25,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hs_de","trainable":true},"inbound_nodes":[[["hs_fl",0,0,{}]]]},{"name":"reshape_Reshape3","class_name":"Reshape","config":{"target_shape":[5,5,1],"name":"reshape_Reshape3","trainable":true},"inbound_nodes":[[["hs_de",0,0,{}]]]}],"input_layers":[["hs_in",0,0]],"output_layers":[["reshape_Reshape3",0,0]]},"keras_version":"tfjs-layers 4.19.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"hs_f1_cv/kernel","shape":[3,3,1,1],"dtype":"float32"},{"name":"hs_f1_cv/bias","shape":[1],"dtype":"float32"},{"name":"hs_f1_bn/gamma","shape":[1],"dtype":"float32"},{"name":"hs_f1_bn/beta","shape":[1],"dtype":"float32"},{"name":"hs_rb1_f1_cv/kernel","shape":[3,3,1,2],"dtype":"float32"},{"name":"hs_rb1_f1_cv/bias","shape":[2],"dtype":"float32"},{"name":"hs_rb1_f1_bn/gamma","shape":[2],"dtype":"float32"},{"name":"hs_rb1_f1_bn/beta","shape":[2],"dtype":"float32"},{"name":"hs_rb2_f1_cv/kernel","shape":[3,3,2,4],"dtype":"float32"},{"name":"hs_rb2_f1_cv/bias","shape":[4],"dtype":"float32"},{"name":"hs_rb2_f1_bn/gamma","shape":[4],"dtype":"float32"},{"name":"hs_rb2_f1_bn/beta","shape":[4],"dtype":"float32"},{"name":"hs_rb3_f1_cv/kernel","shape":[3,3,4,8],"dtype":"float32"},{"name":"hs_rb3_f1_cv/bias","shape":[8],"dtype":"float32"},{"name":"hs_rb3_f1_bn/gamma","shape":[8],"dtype":"float32"},{"name":"hs_rb3_f1_bn/beta","shape":[8],"dtype":"float32"},{"name":"hs_rb4_f1_cv/kernel","shape":[3,3,8,16],"dtype":"float32"},{"name":"hs_rb4_f1_cv/bias","shape":[16],"dtype":"float32"},{"name":"hs_rb4_f1_bn/gamma","shape":[16],"dtype":"float32"},{"name":"hs_rb4_f1_bn/beta","shape":[16],"dtype":"float32"},{"name":"hs_rb5_f1_cv/kernel","shape":[3,3,16,32],"dtype":"float32"},{"name":"hs_rb5_f1_cv/bias","shape":[32],"dtype":"float32"},{"name":"hs_rb5_f1_bn/gamma","shape":[32],"dtype":"float32"},{"name":"hs_rb5_f1_bn/beta","shape":[32],"dtype":"float32"},{"name":"hs_rb6_f1_cv/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"hs_rb6_f1_cv/bias","shape":[64],"dtype":"float32"},{"name":"hs_rb6_f1_bn/gamma","shape":[64],"dtype":"float32"},{"name":"hs_rb6_f1_bn/beta","shape":[64],"dtype":"float32"},{"name":"hs_rb7_f1_cv/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"hs_rb7_f1_cv/bias","shape":[128],"dtype":"float32"},{"name":"hs_rb7_f1_bn/gamma","shape":[128],"dtype":"float32"},{"name":"hs_rb7_f1_bn/beta","shape":[128],"dtype":"float32"},{"name":"hs_rb8_f1_cv/kernel","shape":[3,3,128,256],"dtype":"float32"},{"name":"hs_rb8_f1_cv/bias","shape":[256],"dtype":"float32"},{"name":"hs_rb8_f1_bn/gamma","shape":[256],"dtype":"float32"},{"name":"hs_rb8_f1_bn/beta","shape":[256],"dtype":"float32"},{"name":"hs_de/kernel","shape":[6400,25],"dtype":"float32"},{"name":"hs_de/bias","shape":[25],"dtype":"float32"},{"name":"hs_f1_bn/moving_mean","shape":[1],"dtype":"float32"},{"name":"hs_f1_bn/moving_variance","shape":[1],"dtype":"float32"},{"name":"hs_rb1_f1_bn/moving_mean","shape":[2],"dtype":"float32"},{"name":"hs_rb1_f1_bn/moving_variance","shape":[2],"dtype":"float32"},{"name":"hs_rb2_f1_bn/moving_mean","shape":[4],"dtype":"float32"},{"name":"hs_rb2_f1_bn/moving_variance","shape":[4],"dtype":"float32"},{"name":"hs_rb3_f1_bn/moving_mean","shape":[8],"dtype":"float32"},{"name":"hs_rb3_f1_bn/moving_variance","shape":[8],"dtype":"float32"},{"name":"hs_rb4_f1_bn/moving_mean","shape":[16],"dtype":"float32"},{"name":"hs_rb4_f1_bn/moving_variance","shape":[16],"dtype":"float32"},{"name":"hs_rb5_f1_bn/moving_mean","shape":[32],"dtype":"float32"},{"name":"hs_rb5_f1_bn/moving_variance","shape":[32],"dtype":"float32"},{"name":"hs_rb6_f1_bn/moving_mean","shape":[64],"dtype":"float32"},{"name":"hs_rb6_f1_bn/moving_variance","shape":[64],"dtype":"float32"},{"name":"hs_rb7_f1_bn/moving_mean","shape":[128],"dtype":"float32"},{"name":"hs_rb7_f1_bn/moving_variance","shape":[128],"dtype":"float32"},{"name":"hs_rb8_f1_bn/moving_mean","shape":[256],"dtype":"float32"},{"name":"hs_rb8_f1_bn/moving_variance","shape":[256],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.19.0","convertedBy":null}