{"modelTopology":{"class_name":"Model","config":{"name":"Recurrent Inference","layers":[{"name":"action_plane_input","class_name":"InputLayer","config":{"batch_input_shape":[null,41],"dtype":"float32","sparse":false,"name":"action_plane_input"},"inbound_nodes":[]},{"name":"dynamics_state_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_state_hidden","trainable":true},"inbound_nodes":[[["action_plane_input",0,0,{}]]]},{"name":"dynamics_state_output","class_name":"Dense","config":{"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_state_output","trainable":true},"inbound_nodes":[[["dynamics_state_hidden",0,0,{}]]]},{"name":"dynamics_reward_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_reward_hidden","trainable":true},"inbound_nodes":[[["action_plane_input",0,0,{}]]]},{"name":"prediction_policy_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_policy_hidden","trainable":true},"inbound_nodes":[[["dynamics_state_output",0,0,{}]]]},{"name":"prediction_value_hidden","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_value_hidden","trainable":true},"inbound_nodes":[[["dynamics_state_output",0,0,{}]]]},{"name":"dynamics_reward_output","class_name":"Dense","config":{"units":21,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"Zeros","config":{}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dynamics_reward_output","trainable":true},"inbound_nodes":[[["dynamics_reward_hidden",0,0,{}]]]},{"name":"prediction_policy_output","class_name":"Dense","config":{"units":9,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_policy_output","trainable":true},"inbound_nodes":[[["prediction_policy_hidden",0,0,{}]]]},{"name":"prediction_value_output","class_name":"Dense","config":{"units":21,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"Zeros","config":{}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0.01,"l2":0.01}},"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"prediction_value_output","trainable":true},"inbound_nodes":[[["prediction_value_hidden",0,0,{}]]]}],"input_layers":[["action_plane_input",0,0]],"output_layers":[["dynamics_state_output",0,0],["dynamics_reward_output",0,0],["prediction_policy_output",0,0],["prediction_value_output",0,0]]},"keras_version":"tfjs-layers 3.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dynamics_state_hidden/kernel","shape":[41,64],"dtype":"float32"},{"name":"dynamics_state_hidden/bias","shape":[64],"dtype":"float32"},{"name":"dynamics_state_output/kernel","shape":[64,32],"dtype":"float32"},{"name":"dynamics_state_output/bias","shape":[32],"dtype":"float32"},{"name":"dynamics_reward_hidden/kernel","shape":[41,64],"dtype":"float32"},{"name":"dynamics_reward_hidden/bias","shape":[64],"dtype":"float32"},{"name":"prediction_policy_hidden/kernel","shape":[32,64],"dtype":"float32"},{"name":"prediction_policy_hidden/bias","shape":[64],"dtype":"float32"},{"name":"prediction_value_hidden/kernel","shape":[32,64],"dtype":"float32"},{"name":"prediction_value_hidden/bias","shape":[64],"dtype":"float32"},{"name":"dynamics_reward_output/kernel","shape":[64,21],"dtype":"float32"},{"name":"dynamics_reward_output/bias","shape":[21],"dtype":"float32"},{"name":"prediction_policy_output/kernel","shape":[64,9],"dtype":"float32"},{"name":"prediction_policy_output/bias","shape":[9],"dtype":"float32"},{"name":"prediction_value_output/kernel","shape":[64,21],"dtype":"float32"},{"name":"prediction_value_output/bias","shape":[21],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.21.0","convertedBy":null}